Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/svd/PIC32CX5112MTC128.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="PIO0">
         <name>PIO1</name>
         <baseAddress>0x4800C000</baseAddress>
      </peripheral>
      <peripheral>
         <name>PMC</name>
         <version>44171I</version>
         <description>Power Management Controller</description>
         <baseAddress>0x46800000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xF8</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PMC</name>
            <value>6</value>
         </interrupt>
         <registers>
            <register>
               <name>SCER</name>
               <description>System Clock Enable Register</description>
               <addressOffset>0x0000</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PCK0</name>
                     <description>Programmable Clock 0 Output Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK1</name>
                     <description>Programmable Clock 1 Output Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK2</name>
                     <description>Programmable Clock 2 Output Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK3</name>
                     <description>Programmable Clock 3 Output Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPCK</name>
                     <description>Coprocessor (Second Processor) Clocks Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPBMCK</name>
                     <description>Coprocessor Bus Master Clocks Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPKEY</name>
                     <description>Coprocessor Clocks Enable Key</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>CPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>This field must be written to 0xA to validate CPBMCK and CPCK.</description>
                           <value>0xA</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCDR</name>
               <description>System Clock Disable Register</description>
               <addressOffset>0x0004</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PCK0</name>
                     <description>Programmable Clock 0 Output Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK1</name>
                     <description>Programmable Clock 1 Output Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK2</name>
                     <description>Programmable Clock 2 Output Disable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK3</name>
                     <description>Programmable Clock 3 Output Disable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPCK</name>
                     <description>Coprocessor (Second Processor) Clocks Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPBMCK</name>
                     <description>Coprocessor Bus Master Clocks Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPKEY</name>
                     <description>Coprocessor Clocks Enable Key</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>CPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>This field must be written to 0xA to validate CPBMCK and CPCK.</description>
                           <value>0xA</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCSR</name>
               <description>System Clock Status Register</description>
               <addressOffset>0x0008</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CPU_CLK0S</name>
                     <description>CPU_CLK Status for Core 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPU_CLK1S</name>
                     <description>CPU_CLK Status for Core 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK0</name>
                     <description>Programmable Clock 0 Output Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK1</name>
                     <description>Programmable Clock 1 Output Status</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK2</name>
                     <description>Programmable Clock 2 Output Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK3</name>
                     <description>Programmable Clock 3 Output Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPCK</name>
                     <description>Coprocessor (Second Processor) Clocks Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPBMCK</name>
                     <description>Coprocessor Bus Master Clocks Status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLL_CTRL0</name>
               <description>PLL Control Register 0</description>
               <addressOffset>0x000C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DIVPMC0</name>
                     <description>Divider for PMC output 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DIVPMC1</name>
                     <description>Divider for PMC output 1 (PLLA only)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PLLMS</name>
                     <description>PLL Multiplexer Select</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENPLL</name>
                     <description>Enable PLL</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENPLLO0</name>
                     <description>Enable PLL Clock Output 0</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENPLLO1</name>
                     <description>Enable PLL Clock Output 1 (PLLA only)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENLOCK</name>
                     <description>Enable PLL Lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLL_CTRL1</name>
               <description>PLL Control Register 1</description>
               <addressOffset>0x0010</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MUL</name>
                     <description>Multiplier Factor Value for PLLA, B and C</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLL_CTRL2</name>
               <description>PLL Control Register 2</description>
               <addressOffset>0x0014</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FRACR</name>
                     <description>Fractional Loop Divider Setting</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLL_SSR</name>
               <description>PLL Spread Spectrum Register</description>
               <addressOffset>0x0018</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>STEP</name>
                     <description>Spread Spectrum Step Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>NSTEP</name>
                     <description>Spread Spectrum Number of Step</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ENSPREAD</name>
                     <description>Spread Spectrum Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLL_ACR</name>
               <description>PLL Analog Control Register</description>
               <addressOffset>0x001C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CONTROL</name>
                     <description>PLL Control Value Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_THR</name>
                     <description>PLL Lock Threshold Value Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LOOP_FILTER</name>
                     <description>PLL Loop Filter Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLL_UPDT</name>
               <description>PLL Update Register</description>
               <addressOffset>0x0020</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>PLL ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>UPDATE</name>
                     <description>PLL Setting Update (write-only)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUPTIM</name>
                     <description>Start-up Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CKGR_MOR</name>
               <description>Main Oscillator Register</description>
               <addressOffset>0x0024</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MOSCXTEN</name>
                     <description>Main Crystal Oscillator Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCXTBY</name>
                     <description>12 to 48 MHz Crystal Oscillator Bypass</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAITMODE</name>
                     <description>Wait Mode Command (write-only)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCRCEN</name>
                     <description>Main RC Oscillator Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCXTST</name>
                     <description>Main Crystal Oscillator Start-up Time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Write Access Password</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation. Always reads as 0.</description>
                           <value>0x37</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MOSCSEL</name>
                     <description>Main Clock Oscillator Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MOSCSELSelect</name>
                        <enumeratedValue>
                           <name>RC</name>
                           <description>The main RC oscillator is selected.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XT</name>
                           <description>The main crystal oscillator is selected.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CFDEN</name>
                     <description>Clock Failure Detector Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XT32KFME</name>
                     <description>32.768 kHz Crystal Oscillator Frequency Monitoring Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BMCKRST</name>
                     <description>Bad MCK0 Clock Reset Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CKGR_MCFR</name>
               <description>Main Clock Frequency Register</description>
               <addressOffset>0x0028</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MAINF</name>
                     <description>Main Clock Frequency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MAINFRDY</name>
                     <description>Main Clock Frequency Measure Ready</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCMEAS</name>
                     <description>RC Oscillator Frequency Measure (write-only)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCSS</name>
                     <description>Counter Clock Source Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
